nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1024/drivers/fsl_clock.h
    kCLOCK_SemcDivBy1 = 0, /*!< SEMC divider set to divided by 1. */
    kCLOCK_SemcDivBy2 = 1, /*!< SEMC divider set to divided by 2. */
    kCLOCK_SemcDivBy3 = 2, /*!< SEMC divider set to divided by 3. */
    kCLOCK_SemcDivBy4 = 3, /*!< SEMC divider set to divided by 4. */
    kCLOCK_SemcDivBy5 = 4, /*!< SEMC divider set to divided by 5. */
    kCLOCK_SemcDivBy6 = 5, /*!< SEMC divider set to divided by 6. */
    kCLOCK_SemcDivBy7 = 6, /*!< SEMC divider set to divided by 7. */
    kCLOCK_SemcDivBy8 = 7, /*!< SEMC divider set to divided by 8. */

    kCLOCK_AhbDivBy1 = 0, /*!< AHB divider set to divided by 1. */
    kCLOCK_AhbDivBy2 = 1, /*!< AHB divider set to divided by 2. */
    kCLOCK_AhbDivBy3 = 2, /*!< AHB divider set to divided by 3. */
    kCLOCK_AhbDivBy4 = 3, /*!< AHB divider set to divided by 4. */
    kCLOCK_AhbDivBy5 = 4, /*!< AHB divider set to divided by 5. */
    kCLOCK_AhbDivBy6 = 5, /*!< AHB divider set to divided by 6. */
    kCLOCK_AhbDivBy7 = 6, /*!< AHB divider set to divided by 7. */
    kCLOCK_AhbDivBy8 = 7, /*!< AHB divider set to divided by 8. */

    kCLOCK_IpgDivBy1 = 0, /*!< Ipg divider set to divided by 1. */
    kCLOCK_IpgDivBy2 = 1, /*!< Ipg divider set to divided by 2. */
    kCLOCK_IpgDivBy3 = 2, /*!< Ipg divider set to divided by 3. */
    kCLOCK_IpgDivBy4 = 3, /*!< Ipg divider set to divided by 4. */

    kCLOCK_LpspiDivBy1 = 0, /*!< LPSPI divider set to divided by 1. */
    kCLOCK_LpspiDivBy2 = 1, /*!< LPSPI divider set to divided by 2. */
    kCLOCK_LpspiDivBy3 = 2, /*!< LPSPI divider set to divided by 3. */
    kCLOCK_LpspiDivBy4 = 3, /*!< LPSPI divider set to divided by 4. */
    kCLOCK_LpspiDivBy5 = 4, /*!< LPSPI divider set to divided by 5. */
    kCLOCK_LpspiDivBy6 = 5, /*!< LPSPI divider set to divided by 6. */
    kCLOCK_LpspiDivBy7 = 6, /*!< LPSPI divider set to divided by 7. */
    kCLOCK_LpspiDivBy8 = 7, /*!< LPSPI divider set to divided by 8. */

    kCLOCK_FlexspiDivBy1 = 0, /*!< FLEXSPI divider set to divided by 1. */
    kCLOCK_FlexspiDivBy2 = 1, /*!< FLEXSPI divider set to divided by 2. */
    kCLOCK_FlexspiDivBy3 = 2, /*!< FLEXSPI divider set to divided by 3. */
    kCLOCK_FlexspiDivBy4 = 3, /*!< FLEXSPI divider set to divided by 4. */
    kCLOCK_FlexspiDivBy5 = 4, /*!< FLEXSPI divider set to divided by 5. */
    kCLOCK_FlexspiDivBy6 = 5, /*!< FLEXSPI divider set to divided by 6. */
    kCLOCK_FlexspiDivBy7 = 6, /*!< FLEXSPI divider set to divided by 7. */
    kCLOCK_FlexspiDivBy8 = 7, /*!< FLEXSPI divider set to divided by 8. */

    kCLOCK_TraceDivBy1 = 0, /*!< TRACE divider set to divided by 1. */
    kCLOCK_TraceDivBy2 = 1, /*!< TRACE divider set to divided by 2. */
    kCLOCK_TraceDivBy3 = 2, /*!< TRACE divider set to divided by 3. */
    kCLOCK_TraceDivBy4 = 3, /*!< TRACE divider set to divided by 4. */

    kCLOCK_Usdhc2DivBy1 = 0, /*!< USDHC2 divider set to divided by 1. */
    kCLOCK_Usdhc2DivBy2 = 1, /*!< USDHC2 divider set to divided by 2. */
    kCLOCK_Usdhc2DivBy3 = 2, /*!< USDHC2 divider set to divided by 3. */
    kCLOCK_Usdhc2DivBy4 = 3, /*!< USDHC2 divider set to divided by 4. */
    kCLOCK_Usdhc2DivBy5 = 4, /*!< USDHC2 divider set to divided by 5. */
    kCLOCK_Usdhc2DivBy6 = 5, /*!< USDHC2 divider set to divided by 6. */
    kCLOCK_Usdhc2DivBy7 = 6, /*!< USDHC2 divider set to divided by 7. */
    kCLOCK_Usdhc2DivBy8 = 7, /*!< USDHC2 divider set to divided by 8. */

    kCLOCK_Usdhc1DivBy1 = 0, /*!< USDHC1 divider set to divided by 1. */
    kCLOCK_Usdhc1DivBy2 = 1, /*!< USDHC1 divider set to divided by 2. */
    kCLOCK_Usdhc1DivBy3 = 2, /*!< USDHC1 divider set to divided by 3. */
    kCLOCK_Usdhc1DivBy4 = 3, /*!< USDHC1 divider set to divided by 4. */
    kCLOCK_Usdhc1DivBy5 = 4, /*!< USDHC1 divider set to divided by 5. */
    kCLOCK_Usdhc1DivBy6 = 5, /*!< USDHC1 divider set to divided by 6. */
    kCLOCK_Usdhc1DivBy7 = 6, /*!< USDHC1 divider set to divided by 7. */
    kCLOCK_Usdhc1DivBy8 = 7, /*!< USDHC1 divider set to divided by 8. */

    kCLOCK_Flexio1DivBy1 = 0, /*!< Flexio1 divider set to divided by 1. */
    kCLOCK_Flexio1DivBy2 = 1, /*!< Flexio1 divider set to divided by 2. */
    kCLOCK_Flexio1DivBy3 = 2, /*!< Flexio1 divider set to divided by 3. */
    kCLOCK_Flexio1DivBy4 = 3, /*!< Flexio1 divider set to divided by 4. */
    kCLOCK_Flexio1DivBy5 = 4, /*!< Flexio1 divider set to divided by 5. */
    kCLOCK_Flexio1DivBy6 = 5, /*!< Flexio1 divider set to divided by 6. */
    kCLOCK_Flexio1DivBy7 = 6, /*!< Flexio1 divider set to divided by 7. */
    kCLOCK_Flexio1DivBy8 = 7, /*!< Flexio1 divider set to divided by 8. */

    kCLOCK_Sai3PreDivBy1 = 0, /*!< SAI3ClkPred divider set to divided by 1. */
    kCLOCK_Sai3PreDivBy2 = 1, /*!< SAI3ClkPred divider set to divided by 2. */
    kCLOCK_Sai3PreDivBy3 = 2, /*!< SAI3ClkPred divider set to divided by 3. */
    kCLOCK_Sai3PreDivBy4 = 3, /*!< SAI3ClkPred divider set to divided by 4. */
    kCLOCK_Sai3PreDivBy5 = 4, /*!< SAI3ClkPred divider set to divided by 5. */
    kCLOCK_Sai3PreDivBy6 = 5, /*!< SAI3ClkPred divider set to divided by 6. */
    kCLOCK_Sai3PreDivBy7 = 6, /*!< SAI3ClkPred divider set to divided by 7. */
    kCLOCK_Sai3PreDivBy8 = 7, /*!< SAI3ClkPred divider set to divided by 8. */

    kCLOCK_Flexio1PreDivBy1 = 0, /*!< Flexio1 pred divider set to divided by 1. */
    kCLOCK_Flexio1PreDivBy2 = 1, /*!< Flexio1 pred divider set to divided by 2. */
    kCLOCK_Flexio1PreDivBy3 = 2, /*!< Flexio1 pred divider set to divided by 3. */
    kCLOCK_Flexio1PreDivBy4 = 3, /*!< Flexio1 pred divider set to divided by 4. */
    kCLOCK_Flexio1PreDivBy5 = 4, /*!< Flexio1 pred divider set to divided by 5. */
    kCLOCK_Flexio1PreDivBy6 = 5, /*!< Flexio1 pred divider set to divided by 6. */
    kCLOCK_Flexio1PreDivBy7 = 6, /*!< Flexio1 pred divider set to divided by 7. */
    kCLOCK_Flexio1PreDivBy8 = 7, /*!< Flexio1 pred divider set to divided by 8. */

    kCLOCK_Sai1PreDivBy1 = 0, /*!< SAI1 pred divider set to divided by 1. */
    kCLOCK_Sai1PreDivBy2 = 1, /*!< SAI1 pred divider set to divided by 2. */
    kCLOCK_Sai1PreDivBy3 = 2, /*!< SAI1 pred divider set to divided by 3. */
    kCLOCK_Sai1PreDivBy4 = 3, /*!< SAI1 pred divider set to divided by 4. */
    kCLOCK_Sai1PreDivBy5 = 4, /*!< SAI1 pred divider set to divided by 5. */
    kCLOCK_Sai1PreDivBy6 = 5, /*!< SAI1 pred divider set to divided by 6. */
    kCLOCK_Sai1PreDivBy7 = 6, /*!< SAI1 pred divider set to divided by 7. */
    kCLOCK_Sai1PreDivBy8 = 7, /*!< SAI1 pred divider set to divided by 8. */

    kCLOCK_Sai2PreDivBy1 = 0, /*!< SAI2ClkPred divider set to divided by 1. */
    kCLOCK_Sai2PreDivBy2 = 1, /*!< SAI2ClkPred divider set to divided by 2. */
    kCLOCK_Sai2PreDivBy3 = 2, /*!< SAI2ClkPred divider set to divided by 3. */
    kCLOCK_Sai2PreDivBy4 = 3, /*!< SAI2ClkPred divider set to divided by 4. */
    kCLOCK_Sai2PreDivBy5 = 4, /*!< SAI2ClkPred divider set to divided by 5. */
    kCLOCK_Sai2PreDivBy6 = 5, /*!< SAI2ClkPred divider set to divided by 6. */
    kCLOCK_Sai2PreDivBy7 = 6, /*!< SAI2ClkPred divider set to divided by 7. */
    kCLOCK_Sai2PreDivBy8 = 7, /*!< SAI2ClkPred divider set to divided by 8. */

    kCLOCK_Spdif0PreDivBy1 = 0, /*!< SPDIF0ClkPred divider set to divided by 1. */
    kCLOCK_Spdif0PreDivBy2 = 1, /*!< SPDIF0ClkPred divider set to divided by 2. */
    kCLOCK_Spdif0PreDivBy3 = 2, /*!< SPDIF0ClkPred divider set to divided by 3. */
    kCLOCK_Spdif0PreDivBy4 = 3, /*!< SPDIF0ClkPred divider set to divided by 4. */
    kCLOCK_Spdif0PreDivBy5 = 4, /*!< SPDIF0ClkPred divider set to divided by 5. */
    kCLOCK_Spdif0PreDivBy6 = 5, /*!< SPDIF0ClkPred divider set to divided by 6. */
    kCLOCK_Spdif0PreDivBy7 = 6, /*!< SPDIF0ClkPred divider set to divided by 7. */
    kCLOCK_Spdif0PreDivBy8 = 7, /*!< SPDIF0ClkPred divider set to divided by 8. */

    kCLOCK_Spdif0DivBy1 = 0, /*!< SPDIF0ClkPodf divider set to divided by 1. */
    kCLOCK_Spdif0DivBy2 = 1, /*!< SPDIF0ClkPodf divider set to divided by 2. */
    kCLOCK_Spdif0DivBy3 = 2, /*!< SPDIF0ClkPodf divider set to divided by 3. */
    kCLOCK_Spdif0DivBy4 = 3, /*!< SPDIF0ClkPodf divider set to divided by 4. */
    kCLOCK_Spdif0DivBy5 = 4, /*!< SPDIF0ClkPodf divider set to divided by 5. */
    kCLOCK_Spdif0DivBy6 = 5, /*!< SPDIF0ClkPodf divider set to divided by 6. */
    kCLOCK_Spdif0DivBy7 = 6, /*!< SPDIF0ClkPodf divider set to divided by 7. */
    kCLOCK_Spdif0DivBy8 = 7, /*!< SPDIF0ClkPodf divider set to divided by 8. */

    /* Only kCLOCK_PerclkDiv, kCLOCK_CanDiv,kCLOCK_UartDiv, kCLOCK_Sai3Div, kCLOCK_Sai1Div,
     * kCLOCK_Sai2Div, kCLOCK_Lpi2cDiv can use these.*/
    kCLOCK_MiscDivBy1  = 0,  /*!< Misc divider like LPI2C set to divided by 1. */
    kCLOCK_MiscDivBy2  = 1,  /*!< Misc divider like LPI2C set to divided by 2. */
    kCLOCK_MiscDivBy3  = 2,  /*!< Misc divider like LPI2C set to divided by 3. */
    kCLOCK_MiscDivBy4  = 3,  /*!< Misc divider like LPI2C set to divided by 4. */
    kCLOCK_MiscDivBy5  = 4,  /*!< Misc divider like LPI2C set to divided by 5. */
    kCLOCK_MiscDivBy6  = 5,  /*!< Misc divider like LPI2C set to divided by 6. */
    kCLOCK_MiscDivBy7  = 6,  /*!< Misc divider like LPI2C set to divided by 7. */
    kCLOCK_MiscDivBy8  = 7,  /*!< Misc divider like LPI2C set to divided by 8. */
    kCLOCK_MiscDivBy9  = 8,  /*!< Misc divider like LPI2C set to divided by 9. */
    kCLOCK_MiscDivBy10 = 9,  /*!< Misc divider like LPI2C set to divided by 10. */
    kCLOCK_MiscDivBy11 = 10, /*!< Misc divider like LPI2C set to divided by 11. */
    kCLOCK_MiscDivBy12 = 11, /*!< Misc divider like LPI2C set to divided by 12. */
    kCLOCK_MiscDivBy13 = 12, /*!< Misc divider like LPI2C set to divided by 13. */
    kCLOCK_MiscDivBy14 = 13, /*!< Misc divider like LPI2C set to divided by 14. */
    kCLOCK_MiscDivBy15 = 14, /*!< Misc divider like LPI2C set to divided by 15. */
    kCLOCK_MiscDivBy16 = 15, /*!< Misc divider like LPI2C set to divided by 16. */
    kCLOCK_MiscDivBy17 = 16, /*!< Misc divider like LPI2C set to divided by 17. */
    kCLOCK_MiscDivBy18 = 17, /*!< Misc divider like LPI2C set to divided by 18. */
    kCLOCK_MiscDivBy19 = 18, /*!< Misc divider like LPI2C set to divided by 19. */
    kCLOCK_MiscDivBy20 = 19, /*!< Misc divider like LPI2C set to divided by 20. */
    kCLOCK_MiscDivBy21 = 20, /*!< Misc divider like LPI2C set to divided by 21. */
    kCLOCK_MiscDivBy22 = 21, /*!< Misc divider like LPI2C set to divided by 22. */
    kCLOCK_MiscDivBy23 = 22, /*!< Misc divider like LPI2C set to divided by 23. */
    kCLOCK_MiscDivBy24 = 23, /*!< Misc divider like LPI2C set to divided by 24. */
    kCLOCK_MiscDivBy25 = 24, /*!< Misc divider like LPI2C set to divided by 25. */
    kCLOCK_MiscDivBy26 = 25, /*!< Misc divider like LPI2C set to divided by 26. */
    kCLOCK_MiscDivBy27 = 26, /*!< Misc divider like LPI2C set to divided by 27. */
    kCLOCK_MiscDivBy28 = 27, /*!< Misc divider like LPI2C set to divided by 28. */
    kCLOCK_MiscDivBy29 = 28, /*!< Misc divider like LPI2C set to divided by 29. */
    kCLOCK_MiscDivBy30 = 29, /*!< Misc divider like LPI2C set to divided by 30. */
    kCLOCK_MiscDivBy31 = 30, /*!< Misc divider like LPI2C set to divided by 31. */
    kCLOCK_MiscDivBy32 = 31, /*!< Misc divider like LPI2C set to divided by 32. */
    kCLOCK_MiscDivBy33 = 32, /*!< Misc divider like LPI2C set to divided by 33. */
    kCLOCK_MiscDivBy34 = 33, /*!< Misc divider like LPI2C set to divided by 34. */
    kCLOCK_MiscDivBy35 = 34, /*!< Misc divider like LPI2C set to divided by 35. */
    kCLOCK_MiscDivBy36 = 35, /*!< Misc divider like LPI2C set to divided by 36. */
    kCLOCK_MiscDivBy37 = 36, /*!< Misc divider like LPI2C set to divided by 37. */
    kCLOCK_MiscDivBy38 = 37, /*!< Misc divider like LPI2C set to divided by 38. */
    kCLOCK_MiscDivBy39 = 38, /*!< Misc divider like LPI2C set to divided by 39. */
    kCLOCK_MiscDivBy40 = 39, /*!< Misc divider like LPI2C set to divided by 40. */
    kCLOCK_MiscDivBy41 = 40, /*!< Misc divider like LPI2C set to divided by 41. */
    kCLOCK_MiscDivBy42 = 41, /*!< Misc divider like LPI2C set to divided by 42. */
    kCLOCK_MiscDivBy43 = 42, /*!< Misc divider like LPI2C set to divided by 43. */
    kCLOCK_MiscDivBy44 = 43, /*!< Misc divider like LPI2C set to divided by 44. */
    kCLOCK_MiscDivBy45 = 44, /*!< Misc divider like LPI2C set to divided by 45. */
    kCLOCK_MiscDivBy46 = 45, /*!< Misc divider like LPI2C set to divided by 46. */
    kCLOCK_MiscDivBy47 = 46, /*!< Misc divider like LPI2C set to divided by 47. */
    kCLOCK_MiscDivBy48 = 47, /*!< Misc divider like LPI2C set to divided by 48. */
    kCLOCK_MiscDivBy49 = 48, /*!< Misc divider like LPI2C set to divided by 49. */
    kCLOCK_MiscDivBy50 = 49, /*!< Misc divider like LPI2C set to divided by 50. */
    kCLOCK_MiscDivBy51 = 50, /*!< Misc divider like LPI2C set to divided by 51. */
    kCLOCK_MiscDivBy52 = 51, /*!< Misc divider like LPI2C set to divided by 52. */
    kCLOCK_MiscDivBy53 = 52, /*!< Misc divider like LPI2C set to divided by 53. */
    kCLOCK_MiscDivBy54 = 53, /*!< Misc divider like LPI2C set to divided by 54. */
    kCLOCK_MiscDivBy55 = 54, /*!< Misc divider like LPI2C set to divided by 55. */
    kCLOCK_MiscDivBy56 = 55, /*!< Misc divider like LPI2C set to divided by 56. */
    kCLOCK_MiscDivBy57 = 56, /*!< Misc divider like LPI2C set to divided by 57. */
    kCLOCK_MiscDivBy58 = 57, /*!< Misc divider like LPI2C set to divided by 58. */
    kCLOCK_MiscDivBy59 = 58, /*!< Misc divider like LPI2C set to divided by 59. */
    kCLOCK_MiscDivBy60 = 59, /*!< Misc divider like LPI2C set to divided by 60. */
    kCLOCK_MiscDivBy61 = 60, /*!< Misc divider like LPI2C set to divided by 61. */
    kCLOCK_MiscDivBy62 = 61, /*!< Misc divider like LPI2C set to divided by 62. */
    kCLOCK_MiscDivBy63 = 62, /*!< Misc divider like LPI2C set to divided by 63. */
    kCLOCK_MiscDivBy64 = 63, /*!< Misc divider like LPI2C set to divided by 64. */
} clock_div_value_t;

